## Joins Intro

* Mac user's have more work to do. See the **Mac_Loading the Sakila Sample Database.pdf**

In [1]:
from sqlalchemy import create_engine
import pandas as pd
from warnings import filterwarnings
import pymysql
filterwarnings('ignore', category=pymysql.Warning)
import os

In [2]:
engine = create_engine('mysql+pymysql://root:AQib.21Talib@localhost/sakila')

In [3]:
city = pd.read_sql_query('select * from city', engine)
city.head()

   city_id                city  country_id         last_update
0        1  A Corua (La Corua)          87 2006-02-15 04:45:25
1        2                Abha          82 2006-02-15 04:45:25
2        3           Abu Dhabi         101 2006-02-15 04:45:25
3        4                Acua          60 2006-02-15 04:45:25
4        5               Adana          97 2006-02-15 04:45:25

In [4]:
country = pd.read_sql_query('select * from country', engine)
country.head()

   country_id         country         last_update
0           1     Afghanistan 2006-02-15 04:44:00
1           2         Algeria 2006-02-15 04:44:00
2           3  American Samoa 2006-02-15 04:44:00
3           4          Angola 2006-02-15 04:44:00
4           5        Anguilla 2006-02-15 04:44:00

In [5]:
sql_query = """
select country, city from city 
inner join country on 
country.country_id = city.country_id
"""
joined = pd.read_sql_query(sql_query, engine)
joined.head()

          country    city
0     Afghanistan   Kabul
1         Algeria   Batna
2         Algeria   Bchar
3         Algeria  Skikda
4  American Samoa  Tafuna

* The location is a BLOB. This is an image file. Nowadays, this would be a base64 .png file. Not sure what this is: .gif? .tiff? .jpeg? I wasn't able to decode it.

In [6]:
address = pd.read_sql_query('select * from address', engine)
address.head()

,address_id,address,address2,district,city_id,postal_code,phone,location,last_update
0,1,47 MySakila Drive,None,Alberta,300,,,b'\x00\x00\x00\x00\x01\x01\x00\x00\x00>\n2]c4\...,2014-09-25 22:30:27
1,2,28 MySQL Boulevard,None,QLD,576,,,b'\x00\x00\x00\x00\x01\x01\x00\x00\x00\x8e\x10...,2014-09-25 22:30:09
2,3,23 Workhaven Lane,None,Alberta,300,,14033335568,b'\x00\x00\x00\x00\x01\x01\x00\x00\x00\xcd\xc4...,2014-09-25 22:30:27
3,4,1411 Lillydale Drive,None,QLD,576,,6172235589,b'\x00\x00\x00\x00\x01\x01\x00\x00\x00[\r\xe44...,2014-09-25 22:30:09
4,5,1913 Hanoi Way,,Nagasaki,463,35200,28303384290,b'\x00\x00\x00\x00\x01\x01\x00\x00\x00(\xd17\x...,2014-09-25 22:31:53

## Instructions. Now, find the City Name for each Address


* Should look like this: ![](images/city_join.png)